Tekla.Structures.DirectManipulation.Model.Native.dotBarSurface_t
Structure for returning rebar surface. May be Plane3 or Cylinder3.

Tekla.Structures.DirectManipulation.Model.Native.dotBarSurface_t.SurfaceType
0 for plane, 1 for cylinder.

Tekla.Structures.DirectManipulation.Model.Native.dotBarSurface_t.Point
An axis position on a cylinder, not used for plane.

Tekla.Structures.DirectManipulation.Model.Native.dotBarSurface_t.Direction
The plane normal or cylinder axis direction.

Tekla.Structures.DirectManipulation.Model.Native.dotBarSurface_t.Distance
The radius of the cylinder, origin parpendicular distance for plane.